In [1]:
import pandas as pd
import numpy as np

In [2]:
# use a pandas Series function to find the unique values and their frequencies of the following Series:
series = pd.Series(np.take(list('abcdefghijklmnop'), np.random.randint(16, size=500)))

In [3]:
series # pandas Series is a single row/column. While pandas DataFrame (df) is multiple rows

0      j
1      a
2      i
3      e
4      o
      ..
495    m
496    c
497    h
498    l
499    e
Length: 500, dtype: object

In [5]:
series.unique()

array(['j', 'a', 'i', 'e', 'o', 'g', 'k', 'd', 'm', 'b', 'h', 'l', 'c',
       'n', 'p', 'f'], dtype=object)

In [7]:
series.value_counts()

o    37
m    37
h    37
j    35
c    35
b    34
l    33
n    33
a    31
k    31
g    29
i    28
d    28
e    27
p    23
f    22
dtype: int64

In [8]:
# Get the day of month, week number, day of year and day of week from this pandas series
series = pd.Series(['01 Jan 2020', '10-19-2020', '20150303', '2013/04/04', '2012-05-05', '2013-06-06T12:20'])

In [10]:
pandas_dt = pd.to_datetime('01 Jan 2020')

In [11]:
pandas_dt.day

1

In [12]:
pandas_dt.week

1

In [13]:
pandas_dt.month

1

In [14]:
pandas_dt.year

2020

In [15]:
pandas_dt.minute

0

In [16]:
pandas_dt.hour

0

In [17]:
pandas_dt.timestamp()

1577836800.0

In [18]:
series.apply(pd.to_datetime)

0   2020-01-01 00:00:00
1   2020-10-19 00:00:00
2   2015-03-03 00:00:00
3   2013-04-04 00:00:00
4   2012-05-05 00:00:00
5   2013-06-06 12:20:00
dtype: datetime64[ns]

Read the data from https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv into a pandas dataframe.
Do not download the file.

Then
- print how many columns are of each datatype.
- Change the column name “Type” to “TypeOfCar” and print the head of the dataframe

How many values are missing from each of the columns?
Which columns has the most missing values? (answer with code, without sorting)

In [22]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context


df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [23]:
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

- print how many columns are of each datatype.

In [27]:
df.dtypes.value_counts()

float64    18
object      9
dtype: int64

- Change the column name “Type” to “TypeOfCar” and print the head of the dataframe

In [31]:
df.rename(columns={'Type': 'TypeOfCar'}, inplace=True)

In [32]:
df.head()

,Manufacturer,Model,TypeOfCar,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [34]:
df.columns

Index(['Manufacturer', 'Model', 'TypeOfCar', 'Min.Price', 'Price', 'Max.Price',
       'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail',
       'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

Delete the columns: “EngineSize” and “Length” in 2 different ways. Check (with code) that these columns are indeed gone.

In [35]:
df_test1 = df.copy()
df_test2 = df.copy()

In [36]:
columns_to_remove = ['EngineSize', 'Length']

In [42]:
df_test1.drop(columns = columns_to_remove, inplace = True)

In [44]:
'EngineSize' in df_test1.columns or 'Length' in df_test1.columns

False

In [45]:
for column in columns_to_remove:
    del df_test2[column]

In [46]:
'EngineSize' in df_test2.columns or 'Length' in df_test2.columns

False

Join the following two dataframes by two columns, so they have only the common rows. Remove duplicate
columns (meaning that all values are the same) to keep only one.

In [47]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

In [48]:
df1

    fruit  weight  price
0   apple    high     10
1  banana  medium      4
2  orange     low     10
3   apple    high     12
4  banana  medium      7
5  orange     low      9
6   apple    high     13
7  banana  medium      4
8  orange     low     14

In [51]:
df2

   pazham  kilo  price
0   apple  high      8
1  orange   low      2
2    pine  high      8
3   apple   low     10
4  orange  high      5
5    pine   low      9

In [59]:
df3 = df1.join(df2, lsuffix = '_left', rsuffix = '_right')

In [61]:
df3

    fruit  weight  price_left  pazham  kilo  price_right
0   apple    high          10   apple  high          8.0
1  banana  medium           4  orange   low          2.0
2  orange     low          10    pine  high          8.0
3   apple    high          12   apple   low         10.0
4  banana  medium           7  orange  high          5.0
5  orange     low           9    pine   low          9.0
6   apple    high          13     NaN   NaN          NaN
7  banana  medium           4     NaN   NaN          NaN
8  orange     low          14     NaN   NaN          NaN

In [68]:
df3.groupby('fruit').mean(numeric_only=True)['price_left']

fruit
apple     11.666667
banana     5.000000
orange    11.000000
Name: price_left, dtype: float64

In [69]:
df3.groupby('pazham').mean(numeric_only=True)['price_right']

pazham
apple     9.0
orange    3.5
pine      8.5
Name: price_right, dtype: float64

Split this dataframe with a string column to form a dataframe with 3 columns named “STD”, “City”, and “State.”

# Desired Output:
# 0 STD        City        State
# 1  33     Kolkata  West Bengal
# 2  44     Chennai   Tamil Nadu
# 3  40   Hyderabad    Telengana
# 4  80   Bangalore    Karnataka

In [71]:
df = pd.DataFrame(["STD,City\tState",
"33,Kolkata\tWest Bengal",
"44,Chennai\tTamil Nadu",
"40,Hyderabad\tTelengana",
"80,Bangalore\tKarnataka"], columns=['row'])

In [72]:
df

                       row
0          STD,City\tState
1  33,Kolkata\tWest Bengal
2   44,Chennai\tTamil Nadu
3  40,Hyderabad\tTelengana
4  80,Bangalore\tKarnataka

In [73]:
# delimiter - [, / \t \n ... ]

In [75]:
# “STD”, “City”, and “State.”

df[['STD', 'City']] = df.row.str.split(",", expand = True)

In [78]:
df

   STD                  City
0  STD           City\tState
1   33  Kolkata\tWest Bengal
2   44   Chennai\tTamil Nadu
3   40  Hyderabad\tTelengana
4   80  Bangalore\tKarnataka

In [77]:
del df['row']

In [79]:
df[['City', 'State']] = df.City.str.split("\t", expand = True)

In [80]:
df

   STD       City        State
0  STD       City        State
1   33    Kolkata  West Bengal
2   44    Chennai   Tamil Nadu
3   40  Hyderabad    Telengana
4   80  Bangalore    Karnataka

In [82]:
df = df.iloc[1:] # take all rows except the first row (0)

In [83]:
df

  STD       City        State
1  33    Kolkata  West Bengal
2  44    Chennai   Tamil Nadu
3  40  Hyderabad    Telengana
4  80  Bangalore    Karnataka